Repository: IvanPohorielov/SenseTag
Catalog: NFCNDEFManager/Sources/NFCNDEFManager/Resources/Localizable.xcstrings
Source language: en
Languages: ru, uk

# NFCNDEFManager.NFCError.readerNFCUnsupported
source: NFC is not supported on this device.
ru: NFC не поддерживается на этом устройстве.
uk: NFC не підтримується на цьому пристрої.

# NFCNDEFManager.NFCError.sessionAlreadyRunning
source: NFC session is already running.
ru: Сеанс NFC уже запущен.
uk: Сеанс NFC вже запущений.

# NFCNDEFManager.NFCError.tagNotSupportedStatus
source: NFC tag is not supported.
ru: NFC-метка не поддерживается.
uk: NFC-мітка не підтримується.

# NFCNDEFManager.NFCError.tagReadOnlyStatus
source: NFC tag is read-only.
ru: NFC-метка доступна только для чтения.
uk: NFC-мітка доступна тільки для читання.

# NFCNDEFManager.NFCError.tagUnknownStatus
source: Unknown NFC tag status.
ru: Неизвестный статус NFC-метки.
uk: Невідомий статус NFC-мітки.

# NFCNDEFManager.NFCNDEFWellKnownPayloadType.text
source: Text
ru: Текст
uk: Текст

# NFCNDEFManager.NFCNDEFWellKnownPayloadType.url
source: URL
ru: Ссылка
uk: Посилання

# NFCNDEFManager.NFCReaderError.ndefReaderSessionErrorTagNotWritable
source: The NDEF tag is not writable.
ru: NDEF-метка не доступна для записи.
uk: NDEF-мітка не доступна для запису.

# NFCNDEFManager.NFCReaderError.ndefReaderSessionErrorTagSizeTooSmall
source: The NDEF tag size is too small.
ru: Недостаточно памяти на NDEF-метке.
uk: Недостатньо пам’яті на NDEF-мітці.

# NFCNDEFManager.NFCReaderError.ndefReaderSessionErrorTagUpdateFailure
source: Failed to update the NDEF tag.
ru: Ошибка записи данных в NDEF-метку.
uk: Помилка запису даних у NDEF-мітку.

# NFCNDEFManager.NFCReaderError.ndefReaderSessionErrorZeroLengthMessage
source: The NDEF tag contains no data.
ru: NDEF-метка не содержит данных.
uk: NDEF-мітка не містить даних.

# NFCNDEFManager.NFCReaderError.readerErrorInvalidParameter
source: Invalid parameter provided.
ru: Неверный параметр.
uk: Невірний параметр.

# NFCNDEFManager.NFCReaderError.readerErrorInvalidParameterLength
source: Parameter length is invalid.
ru: Недопустимая длина параметра.
uk: Неприпустима довжина параметра.

# NFCNDEFManager.NFCReaderError.readerErrorParameterOutOfBound
source: Parameter value is out of bounds.
ru: Значение параметра выходит за допустимые пределы.
uk: Значення параметра виходить за допустимі межі.

# NFCNDEFManager.NFCReaderError.readerErrorRadioDisabled
source: NFC Radio is disabled.
ru: NFC отключен.
uk: NFC вимкнено.

# NFCNDEFManager.NFCReaderError.readerErrorSecurityViolation
source: Missing required entitlement or privacy settings.
ru: Отсутствуют необходимые разрешения или настройки конфиденциальности.
uk: Відсутні необхідні дозволи або налаштування конфіденційності.

# NFCNDEFManager.NFCReaderError.readerErrorUnsupportedFeature
source: Core NFC is not supported on this device.
ru: NFC не поддерживается на этом устройстве.
uk: NFC не підтримується на цьому пристрої.

# NFCNDEFManager.NFCReaderError.readerSessionInvalidationErrorFirstNDEFTagRead
source: Session ended after reading the first NDEF tag.
ru: Сеанс завершен после первого прочтения NDEF-метки.
uk: Сеанс завершено після першого зчитування NDEF-мітки.

source: Session terminated unexpectedly.
ru: Сеанс завершился неожиданно.
uk: Сеанс завершився неочікувано.

# NFCNDEFManager.NFCReaderError.readerSessionInvalidationErrorSessionTimeout
source: NFC session timed out.
ru: Время ожидания сеанса истекло.
uk: Час очікування сеансу минув.

# NFCNDEFManager.NFCReaderError.readerSessionInvalidationErrorSystemIsBusy
source: Core NFC is temporarily unavailable.
ru: NFC временно недоступен из-за нагрузки на систему.
uk: NFC тимчасово недоступний через завантаженість системи.

# NFCNDEFManager.NFCReaderError.readerSessionInvalidationErrorUserCanceled
source: Session was canceled by the user.
ru: Сеанс был отменен пользователем.
uk: Сеанс було скасовано користувачем.

# NFCNDEFManager.NFCReaderError.readerTransceiveErrorPacketTooLong
source: Packet length exceeds the limit.
ru: Длина пакета превышает лимит.
uk: Довжина пакета перевищує ліміт.

# NFCNDEFManager.NFCReaderError.readerTransceiveErrorRetryExceeded
source: Maximum transmission retries reached.
ru: Достигнут максимальный предел попыток передачи данных.
uk: Досягнуто максимальну кількість спроб передачі даних.

# NFCNDEFManager.NFCReaderError.readerTransceiveErrorSessionInvalidated
source: Session has been invalidated.
ru: Сеанс был завершен.
uk: Сеанс був завершений.

# NFCNDEFManager.NFCReaderError.readerTransceiveErrorTagConnectionLost
source: Connection to the NFC tag was lost.
ru: Соединение с NFC-меткой потеряно.
uk: З’єднання з NFC-міткою втрачено.

# NFCNDEFManager.NFCReaderError.readerTransceiveErrorTagNotConnected
source: Tag is not connected.
ru: Метка не подключена.
uk: Мітка не підключена.

# NFCNDEFManager.NFCReaderError.readerTransceiveErrorTagResponseError
source: Invalid tag response or no response.
ru: Некорректный ответ от метки или отсутствие ответа.
uk: Некоректна відповідь від мітки або її відсутність.

# NFCNDEFManager.NFCReaderError.tagCommandConfigurationErrorInvalidParameters
source: Invalid tag command configuration parameters.
ru: Неверные параметры конфигурации команды.
uk: Невірні параметри конфігурації команди.

# NFCNDEFManager.readerSession.message.clear
source: Hold your iPhone close to the NFC tag to erase its data.
ru: Поднесите iPhone к метке, чтобы стереть данные.
uk: Піднесіть iPhone до мітки, щоб стерти дані.

# NFCNDEFManager.readerSession.message.lock
source: Hold your iPhone close to the NFC tag to lock it permanently.
ru: Поднесите iPhone к метке, чтобы заблокировать её навсегда.
uk: Піднесіть iPhone до мітки, щоб заблокувати його назавжди.

# NFCNDEFManager.readerSession.message.read
source: Hold your iPhone close to the NFC tag to start scanning.
ru: Поднесите iPhone к метке, чтобы начать сканирование.
uk: Піднесіть iPhone до мітки, щоб розпочати сканування.

# NFCNDEFManager.readerSession.message.write
source: Hold your iPhone close to the NFC tag to write data.
ru: Поднесите iPhone к метке, чтобы записать данные.
uk: Піднесіть iPhone до мітки, щоб записати дані.
